Repository: collectd/pkg-debian
Catalog: debian/po/*.po
Languages: it, nl

source: Layout of RRD files has changed
it: Il formato dei file RRD è cambiato
nl: De lay-out van RRD-bestanden is gewijzigd.

source: The layout of the RRD files created by collectd has changed significantly since version 3.x. In order to keep your old data you have to migrate it. This can be done by using /usr/lib/collectd/utils/migrate-3-4.px.
it: Il formato dei file RRD creati da collectd è cambiato in modo significativo rispetto alla versione 3.x. Per poter mantenere i propri vecchi dati è necessario fare una migrazione. Ciò può essere fatto usando /usr/lib/collectd/utils/migrate-3-4.px.
nl: De lay-out van de RRD-bestanden, die zijn gemaakt door collectd, is sterk gewijzigd sinds versie 3.x. Om uw oude gegevens te behouden zult u deze moeten migreren. Dit kunt u doen door /usr/lib/collectd/utils/migrate-3-4.px te gebruiken.

source: This step requires both the perl and the rrdtool packages to be installed, which is currently not the case. You need to perform the migration manually.
it: Per questo passo è necessario che i pacchetti perl e rrdtool siano entrambi installati, condizione attualmente non soddisfatta. È necessario effettuare la migrazione a mano.
nl: Deze stap vereist dat zowel de perl als de rrdtool pakketten worden genstalleerd, wat op dit moment niet het geval is. U zult de migratie handmatig moeten verrichten.

source: See /usr/share/doc/collectd-core/NEWS.gz for details.
it: Per i dettagli vedere /usr/share/doc/collectd-core/NEWS.gz.
nl: Zie /usr/share/doc/collectd-core/NEWS.gz voor meer informatie.

source: Automatically try to migrate your RRD files?
it: Cercare di migrare automaticamente i file RRD?
nl: Proberen om uw RRD-bestanden automatisch te migreren?

source: This step can be done automatically. In this case a backup of /var/lib/collectd/ is made in /var/backups/. This script is still experimental, though. Do not expect it to work in all cases.
it: Questo passo può essere fatto automaticamente. In tal caso viene creato un backup di /var/lib/collectd/ in /var/backups/. Questo script però è ancora in fase sperimentale; non ci si aspetti che funzioni in tutti i casi.
nl: Deze stap kan automatisch verricht worden. In dat geval wordt er in /var/backups/ een back-up gemaakt van /var/lib/collectd/. Dit script is echter nog experimenteel. Verwacht u niet dat het in alle gevallen werkt.

source: Layout of RRD files has changed in version 5.0
it: Il formato dei file RRD è cambiato nella versione 5.0
nl: De lay-out van RRD-bestanden is gewijzigd in versie 5.0.

source: The layout of some RRD files created by collectd has changed since version 4.x. In order to keep your old data you have to migrate it. This can be done by using /usr/lib/collectd/utils/migrate-4-5.px.
it: Il formato di alcuni file RRD creati da collectd è cambiato rispetto alla versione 4.x. Per poter mantenere i propri vecchi dati è necessario fare una migrazione. Ciò può essere fatto usando /usr/lib/collectd/utils/migrate-4-5.px.
nl: De lay-out van de RRD-bestanden, die zijn gemaakt door collectd, is gewijzigd sinds versie 4.x. Om uw oude gegevens te behouden zult u deze moeten migreren. Dit kunt u doen door /usr/lib/collectd/utils/migrate-4-5.px te gebruiken.

source: See /usr/share/doc/collectd-core/NEWS.gz and the collectd wiki at <https://collectd.org/wiki/index.php/V4_to_v5_migration_guide> for details.
it: Per i dettagli vedere /usr/share/doc/collectd-core/NEWS.gz e il wiki di collectd all'indirizzo <https://collectd.org/wiki/index.php/V4_to_v5_migration_guide>.
nl: Zie /usr/share/doc/collectd-core/NEWS.gz en de wikipagina van collectd, <https://collectd.org/wiki/index.php/V4_to_v5_migration_guide>, voor meer informatie.

source: Remove all collected data (e.g. RRD files)?
it: Rimuovere tutti i dati raccolti (ad esempio, i file RRD)?
nl: All verzamelde gegevens verwijderen (zoals de RRD-bestanden)?

source: The /var/lib/collectd/ directory which contains the data files containing the collected statistics is about to be removed. For example, this directory includes (in the default configuration) all RRD files.
it: La directory /var/lib/collectd/ che contiene i file dei dati con le statistiche raccolte sta per essere rimossa. Per esempio, questa directory (nella configurazione predefinita) include tutti i file RRD.
nl: De map /var/lib/collectd/, welke alle gegevensbestanden met verzamelde statistieken bevat, staat op het punt om verwijderd te worden. Deze map bevat (in de standaardconfiguratie) alle RRD-bestanden.

source: If you're purging the collectd package in order to replace it with a more recent or custom version or if you want to keep the data for further analysis, the data should be kept.
it: Se si sta eliminando il pacchetto collectd per sostituirlo con una versione più recente o una personalizzata, oppure se si desidera mantenere i dati per un'ulteriore analisi, i dati dovrebbero essere conservati.
nl: Als u het pakket collectd opruimt met als doel het te vervangen door een nieuwere of aangepaste versie, of als u verdere analyses op de gegevens wilt uitvoeren, dan dient u de gegevens te bewaren.
